particle-iot/device-os/platform/MCU/rtl872x/src/flash_mal.c
static bool parse_compressed_module_header(flash_device_t dev, uintptr_t addr, size_t size, compressed_module_header* header) {
    if (size < sizeof(module_info_t) + sizeof(compressed_module_header)) {
        return false;
    }
    if (!flash_read(dev, addr + sizeof(module_info_t), (uint8_t*)header, sizeof(compressed_module_header))) {
        return false;
    }
    if (header->size > sizeof(compressed_module_header) && size < sizeof(module_info_t) + header->size) {
        return false;
    }
    if (header->method != 0) { // Raw Deflate
        return false;
    }
    return true;
}

#endif // HAS_COMPRESSED_OTA

bool FLASH_CheckValidAddressRange(flash_device_t flashDeviceID, uint32_t startAddress, uint32_t length) {
    // FIXME: remove magic numbers
    uint32_t endAddress = startAddress + length - 1;
    if (flashDeviceID == FLASH_INTERNAL) {
        return (startAddress >= 0x08000000 && endAddress <= 0x08800000);
    } else if (flashDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
        return startAddress >= 0x00000000 && endAddress <= EXTERNAL_FLASH_SIZE;
#else
        return false;
#endif
    }
    return false;
}

bool FLASH_EraseMemory(flash_device_t flashDeviceID, uint32_t startAddress, uint32_t length) {
    uint32_t numSectors;
    if (FLASH_CheckValidAddressRange(flashDeviceID, startAddress, length) != true) {
        return false;
    }
    if (flashDeviceID == FLASH_INTERNAL) {
        numSectors = CEIL_DIV(length, INTERNAL_FLASH_PAGE_SIZE);
        if (hal_flash_erase_sector(startAddress, numSectors) != 0) {
            return false;
        }
        return true;
    } else if (flashDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
        numSectors = CEIL_DIV(length, sFLASH_PAGESIZE);
        if (hal_exflash_erase_sector(startAddress, numSectors) != 0) {
            return false;
        }
        return true;
#else
        return false;
#endif
    }
    return false;
}

int FLASH_CopyMemory(flash_device_t sourceDeviceID, uint32_t sourceAddress,
                     flash_device_t destinationDeviceID, uint32_t destinationAddress,
                     uint32_t length, uint8_t module_function, uint8_t flags) {
    size_t dest_size = length;
#if HAS_COMPRESSED_OTA
    compressed_module_header comp_header = { 0 };
    if (flags & MODULE_COMPRESSED) {
        if (!parse_compressed_module_header(sourceDeviceID, sourceAddress, length, &comp_header)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        dest_size = comp_header.original_size;
    }
#endif // HAS_COMPRESSED_OTA

    // Check if the memory copy can be performed.
    if (!verify_module(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size,
            module_function, flags)) {
        return FLASH_ACCESS_RESULT_BADARG;
    }
    if (!FLASH_EraseMemory(destinationDeviceID, destinationAddress, dest_size)) {
        return FLASH_ACCESS_RESULT_ERROR;
    }
    if (flags & MODULE_COMPRESSED) {
#if HAS_COMPRESSED_OTA
        // Skip the module info and compressed data headers
        if (length < sizeof(module_info_t) + comp_header.size + 2 /* Prefix size */ + 4 /* CRC-32 */) { // Sanity check
            return FLASH_ACCESS_RESULT_BADARG;
        }
        sourceAddress += sizeof(module_info_t) + comp_header.size;
        length -= sizeof(module_info_t) + comp_header.size + 4;
        // Determine where the compressed data ends
        uint16_t prefix_size = 0;
        if (!flash_read(sourceDeviceID, sourceAddress + length - 2, (uint8_t*)&prefix_size, 2)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        if (length < prefix_size) {
            return FLASH_ACCESS_RESULT_BADARG;
        }
        length -= prefix_size;
        if (!flash_decompress(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
#else
        return FLASH_ACCESS_RESULT_BADARG;
#endif // !HAS_COMPRESSED_OTA
    } else {
        if (!flash_copy(sourceDeviceID, sourceAddress, destinationDeviceID, destinationAddress, length)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
    }
    return FLASH_ACCESS_RESULT_OK;
}

bool FLASH_CompareMemory(flash_device_t sourceDeviceID, uint32_t sourceAddress,
                         flash_device_t destinationDeviceID, uint32_t destinationAddress, uint32_t length) {
    uint32_t endAddress = sourceAddress + length;
    // check address range
    if (FLASH_CheckValidAddressRange(sourceDeviceID, sourceAddress, length) != true) {
        return false;
    }
    if (FLASH_CheckValidAddressRange(destinationDeviceID, destinationAddress, length) != true) {
        return false;
    }
    uint8_t src_buf[COPY_BLOCK_SIZE];
    uint8_t dest_buf[COPY_BLOCK_SIZE];
    uint32_t copy_len = 0;
    /* Program source to destination */
    while (sourceAddress < endAddress) {
        copy_len = (endAddress - sourceAddress) >= COPY_BLOCK_SIZE ? COPY_BLOCK_SIZE : (endAddress - sourceAddress);
        // Read data from source memory address
        if (sourceDeviceID == FLASH_INTERNAL) {
            if (hal_flash_read(sourceAddress, src_buf, copy_len)) {
                return false;
            }
        } else if (sourceDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
            if (hal_exflash_read(sourceAddress, src_buf, copy_len)) {
                return false;
            }
#else
            return false;
#endif
        }
        // Read data from destination memory address
        if (sourceDeviceID == FLASH_INTERNAL) {
            if (hal_flash_read(destinationAddress, dest_buf, copy_len)) {
                return false;
            }
        } else if (sourceDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
            if (hal_exflash_read(destinationAddress, dest_buf, copy_len)) {
                return false;
            }
#else
            return false;
#endif
        }
        if (memcmp(src_buf, dest_buf, copy_len)) {
            /* Failed comparison check */
            return false;
        }
        sourceAddress += copy_len;
        destinationAddress += copy_len;
    }
    /* Passed comparison check */
    return true;
}

volatile int ipcResult = -1;
static void bldUpdateCallback(km0_km4_ipc_msg_t* msg, void* context) {
    DCache_Invalidate((uint32_t)msg->data, sizeof(int));
    ipcResult = *((int*)msg->data);
    DiagPrintf("Bootloader update result: %d\n", ipcResult);
}

bool FLASH_AddToNextAvailableModulesSlot(flash_device_t sourceDeviceID, uint32_t sourceAddress,
                                         flash_device_t destinationDeviceID, uint32_t destinationAddress,
                                         uint32_t length, uint8_t function, uint8_t flags) {
    if ((destinationAddress == KM4_BOOTLOADER_START_ADDRESS || destinationAddress == KM0_PART1_START_ADDRESS) && function == MOD_FUNC_BOOTLOADER) {
        // Send IPC message to KM0 to perform the bootloader update (including Particle bootloader and KM0 part1)
        platform_flash_modules_t module = {};
        module.sourceAddress = sourceAddress; // Change it to the address where you flash the Particle bootloader image
        module.destinationAddress = destinationAddress;
        module.length = length;
        uint8_t ipcMsgType = (destinationAddress == KM4_BOOTLOADER_START_ADDRESS) ? KM0_KM4_IPC_MSG_BOOTLOADER_UPDATE : KM0_KM4_IPC_MSG_KM0_PART1_UPDATE;
        int ret = km0_km4_ipc_send_request(KM0_KM4_IPC_CHANNEL_GENERIC, ipcMsgType, &module,
                                            sizeof(platform_flash_modules_t), bldUpdateCallback, NULL);
        if (ret != 0 || ipcResult != 0) {
            DiagPrintf("KM4 send request failed, ret = %d, ipcResult = %d\n", ret, ipcResult);
            return false;
        } else {
            DiagPrintf("KM4 send request successfully\n");
            return true;
        }
    } else {
        platform_flash_modules_t flash_modules[MAX_MODULES_SLOT];
        uint8_t flash_module_index = MAX_MODULES_SLOT;

        //Read the flash modules info from the dct area
        dct_read_app_data_copy(DCT_FLASH_MODULES_OFFSET, flash_modules, sizeof(flash_modules));

        //fill up the next available modules slot and return true else false
        //slot 0 is reserved for factory reset module so start from flash_module_index = 1
        for (flash_module_index = GEN_START_SLOT; flash_module_index < MAX_MODULES_SLOT; flash_module_index++) {
            if(flash_modules[flash_module_index].magicNumber == 0xABCD) {
                continue;
            } else {
                flash_modules[flash_module_index].sourceDeviceID = sourceDeviceID;
                flash_modules[flash_module_index].sourceAddress = sourceAddress;
                flash_modules[flash_module_index].destinationDeviceID = destinationDeviceID;
                flash_modules[flash_module_index].destinationAddress = destinationAddress;
                flash_modules[flash_module_index].length = length;
                flash_modules[flash_module_index].magicNumber = 0xABCD;
                flash_modules[flash_module_index].module_function = function;
                flash_modules[flash_module_index].flags = flags;
                dct_write_app_data(&flash_modules[flash_module_index],
                                offsetof(application_dct_t, flash_modules[flash_module_index]),
                                sizeof(platform_flash_modules_t));
                return true;
            }
        }
    }
    return false;
}

