particle-iot/device-os/platform/MCU/rtl872x/src/flash_mal.c
bool FLASH_IsFactoryResetAvailable(void) {
    return false;
}

// This function is called in bootloader to perform the memory update process
int FLASH_UpdateModules(void (*flashModulesCallback)(bool isUpdating)) {
    // FAC_RESET_SLOT is reserved for factory reset module
    const size_t module_count = MAX_MODULES_SLOT - GEN_START_SLOT;
    const size_t module_offs = DCT_FLASH_MODULES_OFFSET + sizeof(platform_flash_modules_t) * GEN_START_SLOT;
    platform_flash_modules_t modules[module_count];
    int r = dct_read_app_data_copy(module_offs, modules, sizeof(platform_flash_modules_t) * module_count);
    if (r != 0) {
        return FLASH_ACCESS_RESULT_ERROR;
    }
    int result = FLASH_ACCESS_RESULT_OK;
    bool has_modules = false;
    size_t offs = module_offs;
    for (size_t i = 0; i < module_count; ++i) {
        platform_flash_modules_t* const module = &modules[i];
        if (module->magicNumber == 0xabcd) {
            if (!has_modules) {
                has_modules = true;
                // Turn on RGB_COLOR_MAGENTA toggling during flash update
                if (flashModulesCallback) {
                    flashModulesCallback(true);
                }
            }
            if (module->module_function != MODULE_FUNCTION_BOOTLOADER) {
                // Copy memory from source to destination based on flash device ID
                r = FLASH_CopyMemory(module->sourceDeviceID, module->sourceAddress, module->destinationDeviceID,
                        module->destinationAddress, module->length, module->module_function, module->flags);
                if (r != FLASH_ACCESS_RESULT_OK && result != FLASH_ACCESS_RESULT_RESET_PENDING) {
                    // Propagate errors, prioritize FLASH_ACCESS_RESULT_RESET_PENDING over errors
                    result = r;
                }
            } else {
                // It shouldn't get here
            }
            // Mark the slot as unused
            module->magicNumber = 0xffff;
            r = dct_write_app_data(&module->magicNumber, offs + offsetof(platform_flash_modules_t, magicNumber), sizeof(module->magicNumber));
            if (r != 0 && result != FLASH_ACCESS_RESULT_RESET_PENDING) {
                result = FLASH_ACCESS_RESULT_ERROR;
            }
        }
        offs += sizeof(platform_flash_modules_t);
    }
    // Turn off RGB_COLOR_MAGENTA toggling
    if (has_modules && flashModulesCallback) {
        flashModulesCallback(false);
    }
    return result;
}

int FLASH_ModuleInfo(module_info_t* const infoOut, uint8_t flashDeviceID, uint32_t startAddress, uint32_t* infoOffset) {
    CHECK_TRUE(infoOut, SYSTEM_ERROR_INVALID_ARGUMENT);
    uint32_t offset = 0;
    if (flashDeviceID == FLASH_INTERNAL) {
        rtl_binary_header* header = (rtl_binary_header*)startAddress;
        if (header->signature_high == RTL_HEADER_SIGNATURE_HIGH && header->signature_low == RTL_HEADER_SIGNATURE_LOW) {
            offset = sizeof(rtl_binary_header);
        }
        int ret = hal_flash_read(startAddress + offset, (uint8_t*)infoOut, sizeof(module_info_t));
        if (ret != SYSTEM_ERROR_NONE) {
            return ret;
        }
    } else if (flashDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
        rtl_binary_header header = {};
        int ret = hal_exflash_read(startAddress, (uint8_t*)&header, sizeof(rtl_binary_header));
        if (ret != SYSTEM_ERROR_NONE) {
            return ret;
        }
        if (header.signature_high == RTL_HEADER_SIGNATURE_HIGH && header.signature_low == RTL_HEADER_SIGNATURE_LOW) {
            offset = sizeof(rtl_binary_header);
        }
        ret = hal_exflash_read(startAddress + offset, (uint8_t*)infoOut, sizeof(module_info_t));
        if (ret != SYSTEM_ERROR_NONE) {
            return ret;
        }
#else
        return SYSTEM_ERROR_NOT_SUPPORTED;
#endif
    }
    if (infoOffset) {
        *infoOffset = offset;
    }
    return SYSTEM_ERROR_NONE;
}

int FLASH_ModuleCrcSuffix(module_info_crc_t* crc, module_info_suffix_t* suffix, uint8_t flashDeviceID, uint32_t endAddress) {
    typedef int (*readFn_t)(uintptr_t addr, uint8_t* data_buf, size_t size);
    readFn_t read = NULL;

    if (flashDeviceID == FLASH_INTERNAL) {
        read = hal_flash_read;
    } else if (flashDeviceID == FLASH_SERIAL) {
#ifdef USE_SERIAL_FLASH
        read = hal_exflash_read;
#else
        returrn SYSTEM_ERROR_NOT_SUPPORTED;
#endif
    }
    if (read) {
        if (crc) {
            int ret = read(endAddress, (uint8_t*)crc, sizeof(module_info_crc_t));
            if (ret != SYSTEM_ERROR_NONE) {
                return ret;
            }
        }
        if (suffix) {
            // suffix [endAddress] crc32
            endAddress = endAddress - sizeof(module_info_suffix_t);
            int ret = read(endAddress, (uint8_t*)suffix, sizeof(module_info_suffix_t));
            if (ret != SYSTEM_ERROR_NONE) {
                return ret;
            }
        }
    }
    return SYSTEM_ERROR_NONE;
}

uint32_t FLASH_ModuleAddress(uint8_t flashDeviceID, uint32_t startAddress) {
    module_info_t info = {};
    if (FLASH_ModuleInfo(&info, flashDeviceID, startAddress, NULL) == SYSTEM_ERROR_NONE) {
        return (uint32_t)info.module_start_address;
    }
    return 0;
}

uint32_t FLASH_ModuleLength(uint8_t flashDeviceID, uint32_t startAddress) {
    module_info_t info = {};
    if (FLASH_ModuleInfo(&info, flashDeviceID, startAddress, NULL) == SYSTEM_ERROR_NONE) {
        return ((uint32_t)info.module_end_address - (uint32_t)info.module_start_address);
    }
    return 0;
}

uint16_t FLASH_ModuleVersion(uint8_t flashDeviceID, uint32_t startAddress) {
    module_info_t info = {};
    if (FLASH_ModuleInfo(&info, flashDeviceID, startAddress, NULL) == SYSTEM_ERROR_NONE) {
        return info.module_version;
    }
    return 0;
}

bool FLASH_isUserModuleInfoValid(uint8_t flashDeviceID, uint32_t startAddress, uint32_t expectedAddress) {
    module_info_t info = {};
    int ret = FLASH_ModuleInfo(&info, flashDeviceID, startAddress, NULL);
    return (ret == SYSTEM_ERROR_NONE
            && ((uint32_t)(info.module_start_address) == expectedAddress)
            && ((uint32_t)(info.module_end_address) <= 0x08600000)
            && (info.platform_id == PLATFORM_ID));
}

bool FLASH_VerifyCRC32(uint8_t flashDeviceID, uint32_t startAddress, uint32_t length) {
    if(flashDeviceID == FLASH_INTERNAL && length > 0) {
        uint32_t expectedCRC = __REV((*(__IO uint32_t*)(startAddress + length)));
        uint32_t computedCRC = Compute_CRC32((uint8_t*)startAddress, length, NULL);
        if (expectedCRC == computedCRC) {
            return true;
        }
    } else if(flashDeviceID == FLASH_SERIAL && length > 0) {
#ifdef USE_SERIAL_FLASH
        uint8_t serialFlashData[4]; // FIXME: Use XIP or a larger buffer
        hal_exflash_read((startAddress + length), serialFlashData, 4);
        uint32_t expectedCRC = (uint32_t)(serialFlashData[3] | (serialFlashData[2] << 8) | (serialFlashData[1] << 16) | (serialFlashData[0] << 24));
        uint32_t endAddress = startAddress + length;
        uint32_t len = 0;
        uint32_t computedCRC = 0;
        do {
            len = endAddress - startAddress;
            if (len > sizeof(serialFlashData)) {
                len = sizeof(serialFlashData);
            }
            hal_exflash_read(startAddress, serialFlashData, len);
            computedCRC = Compute_CRC32(serialFlashData, len, &computedCRC);
            startAddress += len;
        } while (startAddress < endAddress);
        if (expectedCRC == computedCRC) {
            return true;
        }
#else
        return false;
#endif
    }
    return false;
}

void FLASH_Begin(uint32_t FLASH_Address, uint32_t imageSize) {
    system_flags.OTA_FLASHED_Status_SysFlag = 0x0000;
    Save_SystemFlags();
#ifdef USE_SERIAL_FLASH
    FLASH_EraseMemory(FLASH_SERIAL, FLASH_Address, imageSize);
#else
    FLASH_EraseMemory(FLASH_INTERNAL, FLASH_Address, imageSize);
#endif
}

int FLASH_Update(const uint8_t *pBuffer, uint32_t address, uint32_t bufferSize) {
    int ret = -1;
#ifdef USE_SERIAL_FLASH
    ret = hal_exflash_write(address, pBuffer, bufferSize);
#else
    ret = hal_flash_write(address, pBuffer, bufferSize);
#endif
    return ret;
}
